{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fbb1","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Domains","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Domain.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1584.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fbb2","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Exploits","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potential Exploit.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1588.005","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fbb3","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Develop Capabilities","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Development Capabilities.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1587","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fbb4","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Code Signing Certificates","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Code Signing Certificates.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1588.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fbb5","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"SEO Poisoning","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potential SEO Poisoning.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1608.006","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fbb6","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Server","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Server.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1584.004","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fbb7","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Serverless","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Serverless.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1584.007","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fbb8","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Acquire Access","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Acquire Access.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1650","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fbb9","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Obtain Capabilities","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Obtain Capabilities.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1588","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb10","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Establish Accounts","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Establish Accounts.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1585","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb11","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"DNS Server","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious DNS Server.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1584.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb12","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Install Digital Certificate","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Installation of Digital Certificates.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1608.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb13","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Exploits","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Exploit.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1587.004","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb14","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Social Media Accounts","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Social Media Account.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1585.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb15","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Web Services","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Web Service.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1584.006","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb16","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Tool","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Tool.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1588.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb17","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Cloud Accounts","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Cloud Account.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1585.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb18","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Web Services","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Web Service.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1583.006","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb19","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Link Target","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Link Target.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1608.005","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb20","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Stage Capabilities","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Stage Capability.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1608","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb21","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Botnet","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potential Botnet.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1584.005","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb22","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Compromise Accounts","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially compromised account.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1586","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb23","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Compromise Infrastructure","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially compromised infrastructure.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1584","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb24","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Virtual Private Server","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Virtual Private Server.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1583.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb25","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Malware","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potential Malware.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1588.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb26","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Email Accounts","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Email Account.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1585.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb27","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Server","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious server.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1583.004","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb28","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Upload Tool","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Upload Tool.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1608.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb29","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Domains","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Domain.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1583.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb30","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Upload Malware","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially Uploaded Malware.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1608.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb31","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Email Accounts","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Email Account.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1586.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb32","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Cloud Accounts","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Cloud Account.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1586.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb33","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Virtual Private Server","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Virtual Private Server.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1584.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb34","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Code Signing Certificates","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious code signing certificate.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1587.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb35","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Drive-by Target","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Drive-by Target.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1608.004","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb36","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Botnet","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potential Botnet.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1583.005","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb37","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Vulnerabilities","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potential Vulnerability.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1588.006","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb38","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Social Media Accounts","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Social Media Account.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1586.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb39","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Malware","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potential Malware.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1587.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb40","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Digital Certificates","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Digital Certificates.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1587.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb41","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"DNS Server","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious DNS Server.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1583.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb42","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Digital Certificates","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Digital Certificates.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1588.004","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb43","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Malvertising","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potential Malvertising.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1583.008","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb44","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Serverless","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potential Serverless instance.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1583.007","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fb45","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Acquire Infrastructure","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious methods to Acquire Infrastructure.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1583","filters":[],"actions":[]}
