{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fii1","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Local Accounts","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Local Accounts.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1078.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fii2","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Spearphishing via Service","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Spearphishing via Service.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1566.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fii3","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Cloud Accounts","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Cloud Accounts.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1078.004","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fii4","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Drive-by Compromise","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Drive-by Compromise.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1189","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fii5","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Hardware Additions","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Hardware Additions.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1200","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fii6","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Spearphishing via Service","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Spearphishing via Service.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1194","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fii7","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Domain Accounts","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Domain Accounts.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1078.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fii8","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Compromise Software Supply Chain","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Compromise Software Supply Chain.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1195.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fii9","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Phishing","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Phishing.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1566","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fi10","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Trusted Relationship","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Trusted Relationship.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1199","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fi11","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Spearphishing Attachment","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Spearphishing Attachment.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1193","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fi12","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Default Accounts","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Default Account.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1078.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fi13","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Supply Chain Compromise","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Supply Chain Compromise.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1195","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fi14","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Replication Through Removable Media","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Replication Through Removable Media.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1091","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fi15","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Compromise Hardware Supply Chain","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Compromised Hardware Supply Chain.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1195.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fi16","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Spearphishing Attachment","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Spearphishing Attachment.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1566.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fi17","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Spearphishing Link","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Spearphishing Link.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1566.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fi18","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Spearphishing Link","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Spearphishing Link.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1192","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fi19","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Compromise Software Dependencies and Development Tools","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Compromised Software Dependencies and Development Tools.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1195.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fi20","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"External Remote Services","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious External Remote Services.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1133","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fi21","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Exploit Public-Facing Application","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Exploit Public-Facing Application.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1190","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fi22","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Valid Accounts","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Valid Account.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1078","filters":[],"actions":[]}
