{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02fff1","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"System Time Discovery","tags":["Wazuh"],"interval":"20m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious System Time Discovery.","risk_score":40,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1124","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02fff2","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Debugger Evasion","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Debugger Evasion.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1622","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02fff3","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Cloud Service Dashboard","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Cloud Service Dashboard.","risk_score":50,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1538","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02fff4","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Software Discovery","tags":["Wazuh"],"interval":"10m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Software Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1518","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02fff5","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Network Service Discovery","tags":["Wazuh"],"interval":"10m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Network Service Discovery.","risk_score":50,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1046","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02fff6","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Remote System Discovery","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Remote System Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1018","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02fff7","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Cloud Service Discovery","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Cloud Service Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1526","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02fff8","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Security Software Discovery","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Security Software Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1518.001","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02fff9","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"System Location Discovery","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious System Location Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1614","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff10","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Query Registry","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Query Registry.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1012","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff11","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"System Language Discovery","tags":["Wazuh"],"interval":"30m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious System Language Discovery.","risk_score":30,"severity":"low","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1614.001","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff12","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Password Policy Discovery","tags":["Wazuh"],"interval":"10m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Password Policy Discovery.","risk_score":70,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1201","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff13","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Local Groups","tags":["Wazuh"],"interval":"10m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Local Groups.","risk_score":50,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1069.001","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff14","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"User Activity Based Checks","tags":["Wazuh"],"interval":"10m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious User Activity Based Checks.","risk_score":50,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1497.002","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff15","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Process Discovery","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Process Discovery.","risk_score":70,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1057","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff16","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Cloud Account","tags":["Wazuh"],"interval":"10m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Cloud Account.","risk_score":30,"severity":"low","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1087.004","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff17","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Cloud Storage Object Discovery","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Cloud Storage Object Discovery.","risk_score":50,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1619","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff18","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Virtualization/Sandbox Evasion","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Virtualization/Sandbox Evasion.","risk_score":90,"severity":"high","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1497","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff19","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"System Network Connections Discovery","tags":["Wazuh"],"interval":"10m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious System Network Connections Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1049","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff20","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Domain Trust Discovery","tags":["Wazuh"],"interval":"20m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Domain Trust Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1482","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff21","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Account Discovery","tags":["Wazuh"],"interval":"10m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Account Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1087","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff22","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"System Network Configuration Discovery","tags":["Wazuh"],"interval":"10m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious System Network Configuration Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1016","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff23","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Browser Information Discovery","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Browser Information Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1217","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff24","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Cloud Infrastructure Discovery","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Cloud Infrastructure Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1580","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff25","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Time Based Evasion","tags":["Wazuh"],"interval":"20m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Time Based Evasion.","risk_score":30,"severity":"low","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1497.003","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff26","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Email Account","tags":["Wazuh"],"interval":"30m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Email Account.","risk_score":50,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1087.003","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff27","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Application Window Discovery","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Application Window Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1010","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff28","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"System Information Discovery","tags":["Wazuh"],"interval":"20m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious System Information Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1082","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff29","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Peripheral Device Discovery","tags":["Wazuh"],"interval":"20m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Peripheral Device Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1120","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff30","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Network Share Discovery","tags":["Wazuh"],"interval":"25m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Network Share Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1135","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff31","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Network Sniffing","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Network Sniffing.","risk_score":85,"severity":"high","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1040","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff32","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"System Service Discovery","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious System Service Discovery.","risk_score":40,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1007","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff33","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Domain Groups","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Domain Groups.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1069.002","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff34","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"System Checks","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious System Checks.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1497.001","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff35","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Local Account","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Local Account.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1087.001","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff36","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Security Software Discovery","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Security Software Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1063","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff37","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Domain Account","tags":["Wazuh"],"interval":"15m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Domain Account.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1087.002","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff38","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Device Driver Discovery","tags":["Wazuh"],"interval":"20m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Device Driver Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1652","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff39","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Group Policy Discovery","tags":["Wazuh"],"interval":"20m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Group Policy Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1615","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff40","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Cloud Groups","tags":["Wazuh"],"interval":"20m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Cloud Groups.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1069.003","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff41","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Permission Groups Discovery","tags":["Wazuh"],"interval":"20m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Permission Groups Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1069","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff42","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Internet Connection Discovery","tags":["Wazuh"],"interval":"30m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Internet Connection Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1016.001","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff43","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Container and Resource Discovery","tags":["Wazuh"],"interval":"10m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Container and Resource Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1613","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff44","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"System Owner/User Discovery","tags":["Wazuh"],"interval":"1m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious System Owner/User Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1033","filters":[],"actions":[]}
{"rule_id":"6443bf9a-8b46-4421-b5c3-6e43cf02ff45","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"File and Directory Discovery","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious File and Directory Discovery.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1083","filters":[],"actions":[]}