{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fgg1","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Spearphishing Service","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Spearphishing Service.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1598.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fgg2","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Determine Physical Locations","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious method to Determine Physical Locations.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1591.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fgg3","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Scan Databases","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Scan Database.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1596.005","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fgg4","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Domain Properties","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Domain Properties.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1590.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fgg5","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Scanning IP Blocks","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Scanning IP Blocks.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1595.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fgg6","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Phishing for Information","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Phishing for Information.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1598","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fgg7","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Identify Roles","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious methods to Identify Roles.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1591.004","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fgg8","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Wordlist Scanning","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Wordlist Scanning.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1595.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fgg9","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Credentials","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Credentials.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1589.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg10","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Social Media","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Social Media.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1593.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg11","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Software","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Software.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1592.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg12","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Firmware","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Firmware.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1592.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg13","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Search Closed Sources","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Search Closed Sources.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1597","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg14","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Search Open Websites/Domains","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Search Open Websites/Domains.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1593","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg15","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Gather Victim Network Information","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious methods to Gather Victim Network Information.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1590","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg16","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Gather Victim Org Information","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious methods to Gather Victim Org Information.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1591","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg17","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"CDNs","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious CDNs.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1596.004","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg18","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Spearphishing Attachment","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Spearphishing Attachment.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1598.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg19","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Client Configurations","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Client Configurations.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1592.004","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg20","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Employee Names","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Employee Names.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1589.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg21","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Code Repositories","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Code Repository.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1593.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg22","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Business Relationships","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Business Relationships.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1591.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg23","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Search Engines","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Search Engines.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1593.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg24","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Network Security Appliances","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Network Security Appliances.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1590.006","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg25","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Email Addresses","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Email Addresses.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1589.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg26","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Active Scanning","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Active Scanning.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1595","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg27","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Search Open Technical Databases","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Search Open Technical Databases.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1596","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg28","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Gather Victim Identity Information","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious methods to Gather Victim Identity Information.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1589","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg29","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Threat Intel Vendors","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Threat Intel Vendors.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1597.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg30","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Network Trust Dependencies","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Network Trust Dependencies.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1590.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg31","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Network Topology","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Network Topology.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1590.004","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg32","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Spearphishing Link","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Spearphishing Link.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1598.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg33","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Hardware","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Hardware.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1592.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg34","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Identify Business Tempo","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious method to Identify Business Tempo.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1591.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg35","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"DNS/Passive DNS","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious DNS/Passive DNS.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1596.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg36","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Search Victim-Owned Websites","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Search Victim-Owned Websites.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1594","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg37","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"WHOIS","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious WHOIS.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1596.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg38","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"DNS","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious DNS.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1590.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg39","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"IP Addresses","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious IP Addresses.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1590.005","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg40","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Purchase Technical Data","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious methods to Purchase Technical Data.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1597.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg41","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Digital Certificates","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Digital Certificates.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1596.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg42","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Gather Victim Host Information","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious methods to Gather Victim Host Information.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1592","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fg43","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Vulnerability Scanning","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Vulnerability Scanning.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1595.002","filters":[],"actions":[]}
