{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fee1","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"InstallUtil","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious InstallUtil.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1118","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fee2","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"PowerShell","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious PowerShell.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1086","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fee3","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"PowerShell","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Service Execution.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1035","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fee4","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Service Execution","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Service Execution.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1035","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fee5","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"At","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious At.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1053.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fee6","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Service Execution","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Service Execution.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1569.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fee7","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Malicious Link","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Malicious Link.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1204.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fee8","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Dynamic Data Exchange","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Dynamic Data Exchange.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1173","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fee9","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Serverless Execution","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Serverless Execution.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1648","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe10","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Space after Filename","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Space after Filename.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1151","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe11","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Visual Basic","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Visual Basic.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1059.005","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe12","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Cloud Administration Command","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Cloud Administration Command.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1651","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe13","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Compiled HTML File","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Compiled HTML File.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1223","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe14","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Windows Command Shell","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Windows Command Shell.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1059.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe15","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"System Services","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious System Services.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1569","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe16","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Python","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Python instance.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1059.006","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe17","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Windows Remote Management","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Windows Remote Management.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1028","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe18","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Local Job Scheduling","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Local Job Scheduling.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1168","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe19","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Exploitation for Client Execution","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potential Exploitation for Client Execution.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1203","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe20","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Trap","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potential Trap.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1154","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe21","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Malicious Image","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potential Malicious Image.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1204.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe22","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Inter-Process Communication","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Inter-Process Communication.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1559","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe23","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Unix Shell","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Unix Shell.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1059.004","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe24","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Graphical User Interface","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Graphical User Interface.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1061","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe25","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Systemd Timers","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Systemd Timer.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1053.006","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe26","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Mshta","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Mshta.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1170","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe27","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"PowerShell","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious PowerShell.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1059.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe28","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Software Deployment Tools","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Software Deployment Tool.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1072","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe29","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Launchd","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Launchd.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1053.004","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe30","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Control Panel Items","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Control Panel Item.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1196","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe31","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"User Execution","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious User Execution.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1204","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe32","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"XPC Services","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious XPC Services.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1559.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe33","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Network Device CLI","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Network Device CLI.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1059.008","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe34","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Launchctl","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Launchctl.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1569.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe35","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Scripting","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Scripting.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1064","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe36","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"CMSTP","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious CMSTP.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1191","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe37","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Container Administration Command","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Container Administration Command.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1609","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe38","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Component Object Model and Distributed COM","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Component Object Model and Distributed COM.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1175","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe39","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Command and Scripting Interpreter","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Command and Scripting Interpreter.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1059","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe40","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"LSASS Driver","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious LSASS Driver.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1177","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe41","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Regsvr32","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Regsvr32.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1117","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe42","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"At (Linux)","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious At (Linux).","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1053.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe43","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Rundll32","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Rundll32.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1085","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe44","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"AppleScript","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious AppleScript.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1155","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe45","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Deploy Container","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Deploy Container.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1610","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe46","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Deploy Container","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Deploy Container.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1610","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe47","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Cloud API","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Cloud API.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1059.009","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe48","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Launchctl","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Launchctl.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1152","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe49","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Source","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Source.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1153","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe50","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Native API","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Native API.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1106","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe51","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"AppleScript","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious AppleScript.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1059.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe52","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Scheduled Task/Job","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Scheduled Task/Job.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1053","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe53","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Component Object Model","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Component Object Model.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1559.001","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe54","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Cron","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Cron.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1053.003","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe55","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Malicious File","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Malicious File.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1204.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe56","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Dynamic Data Exchange","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Dynamic Data Exchange.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1559.002","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe57","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Regsvcs/Regasm","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Regsvcs/Regasm.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1121","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe58","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Container Orchestration Job","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected a potentially suspicious Container Orchestration Job.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1053.007","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe59","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"JavaScript","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious JavaScript.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1059.007","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe60","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Shared Modules","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Shared Modules.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1129","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe61","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Windows Management Instrumentation","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Windows Management Instrumentation.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1047","filters":[],"actions":[]}
{"rule_id":"7443bf9a-8b46-4421-b5c3-6e43cf02fe62","updated_at":"2024-11-09T08:34:43.260Z","updated_by":"elastic","created_at":"2024-11-09T08:33:06.223Z","created_by":"elastic","name":"Scheduled Task","tags":["Wazuh"],"interval":"5m","enabled":true,"revision":1,"description":"Wazuh has detected potentially suspicious Scheduled Task.","risk_score":60,"severity":"medium","license":"","output_index":"","meta":{"from":"1m"},"investigation_fields":{"field_names":["@timestamp","agent.ip","agent.name","rule.description"]},"author":[],"false_positives":[],"from":"now-360s","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh*"],"query":"rule.mitre.id : T1053.005","filters":[],"actions":[]}
